In [2]:
import numpy as np
import pandas as pd
d = {
    'A': [1,2, np.nan],
    'B':[5, np.nan, np.nan],
    'C':[1,2,3]
}
df=pd.DataFrame(d)

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [5]:
df.dropna(axis = 0)

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.fillna(value='wow')

     A    B  C
0  1.0  5.0  1
1  2.0  wow  2
2  wow  wow  3

In [9]:
df=pd.DataFrame(d)

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
a = df['A'].fillna(value = df['A'].mean())

In [12]:
a

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [13]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [20]:
import numpy as np
import pandas as pd
data = {
    'Company':['Google', 'Google', 'MSFT', 'FB','FB','IBM'],
    'Person': ['Sam','Nihad','Any','Van','Rakib','Ovi'],
    'Sales': [200, 120, 340, 124, 243, 350]
}
df=pd.DataFrame(data)

In [21]:
df

  Company Person  Sales
0  Google    Sam    200
1  Google  Nihad    120
2    MSFT    Any    340
3      FB    Van    124
4      FB  Rakib    243
5     IBM    Ovi    350

In [44]:
bycomp=df.groupby('Company')
bycomp['Company'].mean()

TypeError: agg function failed [how->mean,dtype->object]

In [26]:
bycomp.sum()

           Person  Sales
Company
FB       VanRakib    367
Google   SamNihad    320
IBM           Ovi    350
MSFT          Any    340

In [27]:
df

  Company Person  Sales
0  Google    Sam    200
1  Google  Nihad    120
2    MSFT    Any    340
3      FB    Van    124
4      FB  Rakib    243
5     IBM    Ovi    350

In [31]:
bycomp.std()

ValueError: could not convert string to float: 'Sam'

In [32]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
Google        2      2
IBM           1      1
MSFT          1      1

In [33]:
df

  Company Person  Sales
0  Google    Sam    200
1  Google  Nihad    120
2    MSFT    Any    340
3      FB    Van    124
4      FB  Rakib    243
5     IBM    Ovi    350

In [34]:
df.groupby('Company').describe()

        Sales
        count   mean        std    min     25%    50%     75%    max
Company
FB        2.0  183.5  84.145707  124.0  153.75  183.5  213.25  243.0
Google    2.0  160.0  56.568542  120.0  140.00  160.0  180.00  200.0
IBM       1.0  350.0        NaN  350.0  350.00  350.0  350.00  350.0
MSFT      1.0  340.0        NaN  340.0  340.00  340.0  340.00  340.0

In [39]:
df1=pd.DataFrame(np.random.randint(1,20,size=(4,3)),[1,2,3,4],['w','o','w'])

In [40]:
df1

    w   o   w
1   3   5  17
2  13  17  12
3   3  14   5
4  11  17   6

In [67]:
df2=pd.DataFrame(np.random.randint(20,40,size=(4,3)),[5,6,7,8],['F','I','V'])

In [68]:
df2

    F   I   V
5  38  37  26
6  39  37  22
7  38  20  27
8  36  24  27

In [70]:
df3 = pd.DataFrame(np.random.randint(40,60, size = (4, 3)), [9,10,11,12], ['W', 'X', 'Y'])

In [71]:
df3

     W   X   Y
9   42  55  41
10  54  41  54
11  57  46  54
12  46  41  59

In [79]:
frame=[df1,df2,df3]
frame

[    w   o   w
 1   3   5  17
 2  13  17  12
 3   3  14   5
 4  11  17   6,
     F   I   V
 5  38  37  26
 6  39  37  22
 7  38  20  27
 8  36  24  27,
      W   X   Y
 9   42  55  41
 10  54  41  54
 11  57  46  54
 12  46  41  59]

In [80]:
pd.concat(frame)

InvalidIndexError: Reindexing only valid with uniquely valued Index objects

In [81]:
pd.concat(frame,axis=1)

       w     o     w     F     I     V     W     X     Y
1    3.0   5.0  17.0   NaN   NaN   NaN   NaN   NaN   NaN
2   13.0  17.0  12.0   NaN   NaN   NaN   NaN   NaN   NaN
3    3.0  14.0   5.0   NaN   NaN   NaN   NaN   NaN   NaN
4   11.0  17.0   6.0   NaN   NaN   NaN   NaN   NaN   NaN
5    NaN   NaN   NaN  38.0  37.0  26.0   NaN   NaN   NaN
6    NaN   NaN   NaN  39.0  37.0  22.0   NaN   NaN   NaN
7    NaN   NaN   NaN  38.0  20.0  27.0   NaN   NaN   NaN
8    NaN   NaN   NaN  36.0  24.0  27.0   NaN   NaN   NaN
9    NaN   NaN   NaN   NaN   NaN   NaN  42.0  55.0  41.0
10   NaN   NaN   NaN   NaN   NaN   NaN  54.0  41.0  54.0
11   NaN   NaN   NaN   NaN   NaN   NaN  57.0  46.0  54.0
12   NaN   NaN   NaN   NaN   NaN   NaN  46.0  41.0  59.0

In [57]:
left = {
    'key':['k0','k1','k2','k3'],
    'A':[10,20,30,40],
    'B':[1,2,3,4]
}

In [58]:
right = {
    'key':['k0','k1','k2','k3'],
    'C':[100,200,300,400],
    'D':[11,12,13,14]
}

In [59]:
left=pd.DataFrame(left)

In [60]:
right=pd.DataFrame(right)

In [82]:
left

  key   A  B
0  k0  10  1
1  k1  20  2
2  k2  30  3
3  k3  40  4

In [83]:
right

  key    C   D
0  k0  100  11
1  k1  200  12
2  k2  300  13
3  k3  400  14

In [86]:
pd.merge(left,right, on='key')

  key   A  B    C   D
0  k0  10  1  100  11
1  k1  20  2  200  12
2  k2  30  3  300  13
3  k3  40  4  400  14

In [87]:
left = {
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2']
}

In [88]:
right = {
    'C':['C0','C2','C3'],
    'D':['D0','D2','D3']
}

In [89]:
left=pd.DataFrame(left,index=['k0','k1','k2'])

In [90]:
right=pd.DataFrame(right,index=['k0','k1','k2'])

In [91]:
left

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2

In [92]:
right

     C   D
k0  C0  D0
k1  C2  D2
k2  C3  D3

In [94]:
right.join(left,how='inner')

     C   D   A   B
k0  C0  D0  A0  B0
k1  C2  D2  A1  B1
k2  C3  D3  A2  B2

In [95]:
df = pd.DataFrame({
    'col1':[444,555,666,444],
    'col2':[1,2,3,4],
    'col3':['abc','def','ghi','xyz']
})

In [96]:
df

   col1  col2 col3
0   444     1  abc
1   555     2  def
2   666     3  ghi
3   444     4  xyz

In [97]:
df['col1'].unique()

array([444, 555, 666])

In [98]:
df['col1'].value_counts()

col1
444    2
555    1
666    1
Name: count, dtype: int64

In [99]:
df['col1'].nunique()

3

In [102]:
def times2(x):
    return 2*x

In [103]:
df['col2'].apply(times2)

0    2
1    4
2    6
3    8
Name: col2, dtype: int64

In [106]:
 df['col2'].apply(lambda x:x**2)

0     1
1     4
2     9
3    16
Name: col2, dtype: int64

In [107]:
df = pd.read_excel('SampleData.xlsx', sheet_name = 'SalesOrders')

FileNotFoundError: [Errno 2] No such file or directory: 'SampleData.xlsx'